Repository: Abdulaziz-Aleissa/Stock-Price-Predictor
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Stock Price Predictor - Professional Analytics Platform
ar: متنبئ أسعار الأسهم - منصة التحليل المهنية

source: Advanced stock price prediction with professional analytics, news sentiment analysis, and comprehensive financial insights.
ar: توقع أسعار الأسهم المتقدم مع التحليلات المهنية، وتحليل المشاعر الإخبارية، والرؤى المالية الشاملة.

source: Welcome, %(username)s!
ar: مرحباً، %(username)s!

source: Stock Price Predictor
ar: متنبئ أسعار الأسهم

source: Professional-grade stock analysis with AI-powered predictions, real-time news sentiment, and advanced analytics
ar: تحليل الأسهم بمستوى مهني مع التنبؤات المدعومة بالذكاء الاصطناعي، ومشاعر الأخبار في الوقت الفعلي، والتحليلات المتقدمة

source: Enter stock ticker (e.g., AAPL, GOOGL, TSLA)...
ar: أدخل رمز السهم (مثل AAPL، GOOGL، TSLA)...

source: ANALYZE STOCK
ar: تحليل السهم

source: Advanced Analytics
ar: التحليلات المتقدمة

source: Technical Analysis • Indicators
ar: التحليل الفني • المؤشرات

source: Real-Time News
ar: الأخبار المباشرة

source: Sentiment Analysis • Market Insights
ar: تحليل المشاعر • رؤى السوق

source: AI Predictions
ar: توقعات الذكاء الاصطناعي

source: Machine Learning • High Accuracy
ar: التعلم الآلي • دقة عالية

source: Financial Education
ar: التعليم المالي

source: Dashboard
ar: لوحة التحكم

source: Logout
ar: تسجيل الخروج

source: Login
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب

source: Welcome back, %(username)s!
ar: مرحباً بعودتك، %(username)s!

source: Access your %(dashboard_link)s for portfolio tracking and advanced analytics.
ar: ادخل إلى %(dashboard_link)s لتتبع المحفظة والتحليلات المتقدمة.

source: personalized dashboard
ar: لوحة التحكم الشخصية

source: Unlock Premium Features!
ar: اكتشف الميزات المميزة!

source: %(signup_link)s to access portfolio tracking, advanced analytics, and personalized insights.
ar: %(signup_link)s للوصول إلى تتبع المحفظة والتحليلات المتقدمة والرؤى الشخصية.

source: Create an account
ar: إنشاء حساب
